function lab03_main
%=== Дисципліна:Основи обробки біомедичної інформації ===
%--- Лабораторна робота #3 ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З НІХ
%
% Використовуйте файли даних: 
%   ecg105.txt - сигнал ЕКГ
%   ecg2x60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%
%----------------------------------------------------------

clear, clc, close all
disp('Лабораторна робота #3')
disp('ФІЛЬТРАЦІЯ БІОСИГНАЛІВ ФІЛЬТРАМИ З НІХ')
disp('Виконав: , група ... ІІДС')

%=== Завдання #1.1 ===
% Синтезування смугового фільтру 2-го порядку 
r = 0.6;
FirstTask(r)
%=== Завдання #1.3 ===
% r = 0.7
r = 0.7;
FirstTask(r)
% r = 0.9
r = 0.9;
FirstTask(r)
%=== Завдання #1.4 ===
% Визначення добротності заданих фільтрів 
%Q1 = fc/(f2-f1) = 20/(100-0) = 0.2
%Q2 = fc/(f2-f1) = 20/(70-5) = 0.307
%Q3 = fc/(f2-f1) = 20/(24-17) = 2.8
%=== Завдання #2.1 ===
% Фільтрація ЕКГ при r = 0.6
SecondTask(0.6)
%=== Завдання #2.2 ===
% Фільтрація ЕКГ при r = 0.7 та r = 0.8
% r = 0.7
SecondTask(0.7)
% r = 0.8
SecondTask(0.8)
%=== Завдання #3.1 ===
% Дослідження властивостей режекторного НІХ-фільтру
fs = 200;
r = 0.8; 
phi1 = 110*pi/180;
phi2 = 130*pi/180;
a1 = [1 -2*r*cos(phi1) r^2];
a2 = [1 -2*r*cos(phi2) r^2];
a = conv(a1, a2);
b = [1*a 1 1];
H = filt (b, 3*a) % передавальна функція

%=== Завдання #3.2 ===
% АЧХ та ФЧХ смугового режекторного НІХ-фільтру
n = 512;  % кількість точок, що розраховуються
[h,w] = freqz(b,a,n);
mag = abs(h);
phase = angle(h)*180/pi;
figure(1)
subplot(2,1,1), plot(w/(2*pi)*fs,mag),grid on
xlabel('Hz');ylabel('dB')
xlim([0 100])
subplot(2,1,2), plot(w/(2*pi)*fs,unwrap(phase)),grid on
xlabel('Hz');ylabel('phase')
xlim([0 100])
x = roots(b);%nuli
fprintf('nuli =%4.3g\n ', x);
y = roots(a);%polusu
fprintf('polusy =%4.3g\n ', y);
figure(2)
zplane(x,y);
%=== Завдання #3.3 ===
% Порівняння АЧХ і ФЧХ режекторних НІХ і СІХ-фильтрів
CIXfilter()
%=== Завдання #3.4 ===
% Фільтрацію сигналу ЕКГ(файл ecg2x60.dat) режекторним фільтром
ecg = load('ecg2x60.dat');% сигнал ЕКГ
ecg = detrend(ecg);
ecgf = filter(b,a,ecg);
t = (0:length(ecg)-1)/fs; 
figure(3)
subplot(2,1,1), plot(t,ecg)
xlabel('time(s)');ylabel('Без фільру')
xlim([1 1.5])
subplot(2,1,2), plot(t,ecgf)
xlabel('time(s)');ylabel('З режекторним фільтром')
xlim([1 1.5])
%=== Завдання #4.1 ===
% АЧХ і ФЧХ цифрових інтеграторів
% Інтегрування методом прямокутників 
fs =            % частота дискретизації
T = 
b =            % чисельник ПФ
a =          % знаменник ПФ
% Інтегрування методом трапецій.
b1 = 
a1 = 
% Інтегрування методом парабол (Сімпсона)
b2 = 
a2 = 

n  =   % кількість точок, що розраховуються
[...] = freqz(...);
...

... введіть позначення осей графіків
...

%=== Завдання #4.2 ===
% Обчислення нулів та полюсів інтеграторів
...

% Карта нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

% Карта нулів та полюсів фільтру
...

%=== Завдання #4.3 ===
% Обчислення абсолютної похибки АЧХ
mag0 =   		% АЧХ ідеального інтегратора 
err = 
	
err1 = 
...

%=== Завдання #4.4 ===
% Інтегрування сигналу ЕКГ (файл ecg105.txt) інтеграторами 
fs = 
ecg =  % сигнал ЕКГ
ecg = 

% інтегратор за методом прямокутників
...

% інтегратор за методом трапецій
...

% інтегратор за методом парабол (Сімпсона)
...

% Графіки результатів інтегрування
...