%function lab04_main
%=== Дисципліна: Основи обробки біомедичнеої інформації ===
%--- Лабораторна робота #4 ОПТИМАЛЬНА І АДАПТИВНА ФІЛЬТРАЦІЯ БІОСИГНАЛІВ 
%
% Використовуйте файли даних: 
% ecg2x60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%
% Функції (m-файли), що необхідно розробити:
% wiener_hopf.m - обчислення коефіцієнтів фільтра Вінера
% lms.m - LMS-алгоритм адаптації
%----------------------------------------------------------
clear, clc, close all
disp('Лабораторна робота #4')
disp('ОПТИМАЛЬНА І АДАПТИВНА ФІЛЬТРАЦІЯ БІОСИГНАЛІВ')
disp('Виконав:  , група ... ННІІДС')

%=== Завдання #1.1 ===
% Моделювання досліджуваного сигналу
 fs = 200; N = 400; 
 t = (0:(N-1))/fs;		% вектор часу
 v = 2*rand(size(t)) ;  
 s = sin(2*pi*10*t)+sin(2*pi*20*t);
 x = s + v ;
%=== Завдання #1.2 ===
%Синтезування оптимального фільтру Вінера довжиною L=32
 L = 32 ; 			       % порядок фільтра
 b = wiener(x,s,L);	   % обчислення коефіцієнтів

%=== Завдання #1.3 ===
 %Фільтрація досліджуваного сигналу 
FilterTask(fs,x,b,s);

L = 64 ; 
b = wiener(x,s,L);
FilterTask(fs,x,b,s);

L = 128 ; 			       
b = wiener(x,s,L);
FilterTask(fs,x,b,s);

L = 256 ; 			       
b = wiener(x,s,L);
FilterTask(fs,x,b,s);

%=== Завдання #2.1 ===
% Моделювання досліджуваного сигналу
fs = 200; 
N = 400; 
t = (0:(N-1))/fs;		% вектор часу
s = sin(2*pi*10*t);
v = 2*rand(size(t));   
x = s + v;

%=== Завдання #2.2-2.3 ===
% Синтезу адаптивного фільтру. Фільтрація змодельваного сигналу.
L = 128; mu = 0.0001;
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
figure(3)
subplot(3,1,1), plot(s),grid on
xlabel('s(n)');ylabel(' ')
xlim([0 100])
subplot(3,1,2), plot(y),grid on
xlabel('y(n)');ylabel(' ')
xlim([0 100])

% ----- АЧХ адаптивного фільтру
n = 512 ;  % кількість точок, що розраховуються
a = 1;
[h,w] = freqz(b,a,n);
mag = abs(h);
subplot(3,1,3), plot(w/(2*pi)*fs,mag),grid on
xlabel('Hz');ylabel('dB')
xlim([0 100])

%=== Завдання #2.4 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру
fs = 200; 
N = 400; 
t = (0:(N-1))/fs;		% вектор часу
s = sin(2*pi*10*t);
v = 2*rand(size(t));   
x = s + v;
%256
L = 256; mu = 0.0001; 
b = wiener(x,s,L);	 
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)
%512
L =  512; mu =  0.0001;
b = wiener(x,s,L);
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)
%1024
L = 1024; mu = 0.0001;
b = wiener(x,s,L);
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)
%=== Завдання #3.1 ===
% Моделювання досліджуваного сигналу
fs = 200; 
N = 400;
t = (0:N-1)/fs;
s1 = sin(2*pi*10*t);   
s2 = sin(2*pi*20*t); 
s = s1 + s2;
v =  2*randn(size(t));  
x =  s + v ;

% Фільтрація сигналу адаптивним фільтром
L = 64 ; mu = 0.0001;
b = wiener(x,s,L);	
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)

%=== Завдання #3.3  ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації

%=== Завдання #3.4 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру
L = 128 ; mu = 0.0001;
b = wiener(x,s,L);	
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)

L = 512 ; mu = 0.0001;
b = wiener(x,s,L);	
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)

L = 1024 ; mu = 0.0001;
b = wiener(x,s,L);	
[y,e,w] = lms(x,s,mu,L);
% Графіки результату фільтрації
ResPlot(fs,s,y,b)

%=== Завдання #4.1 ===
% Завантаження сигналу ЕКГ з перешкодою (файл ecg2x60.dat) 
ecg = load('ecg2x60.dat');% сигнал ЕКГ

%=== Завдання #4.2 ===
% Фільтрація сигналу адаптивним фільтром
fs = 200; f = 60;
t = (0:length(ecg)-1)/fs;
d = [cos(2*pi*f*t);sin(2*pi*f*t)] ;		% опорний сигнал
mu = 0.1 ;
[y,e,w] = lms60(ecg,d,mu);
% Графіки результату фільтрації
figure(4)
subplot(3,1,1), plot(y),grid on
xlabel('Вихідний сигнал');ylabel(' ')
subplot(3,1,2), plot(ecg),grid on
xlabel('ЕКГ сигнал');ylabel(' ')
subplot(3,1,3), plot(e),grid on
xlabel('Відфільтрований сигнал');ylabel(' ')
%=== Завдання #4.3 ===
% Визначення значення коефіцієнтів адаптивного фільтру після закінчення адаптації

%=== Завдання #4.4 ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації

